jimmywong2003/nrf5-ancs-ams-wristband-example/sdk_mod/ble_ams_c/nrf_ble_ams_c.h
/** @file
 *
 * @defgroup ble_ams_c Apple Media Service client
 * @{
 * @ingroup ble_sdk_srv
 *
 * @brief Apple Media Service Client Module.
 *
 * @details Disclaimer: This client implementation of the Apple Media Service can
 *          be changed at any time by Nordic Semiconductor ASA. Server implementations such as the
 *          ones found in iOS can be changed at any time by Apple and may cause this client
 *          implementation to stop working.
 *
 * This module implements the Apple Media Service (AMS) client.
 * This client can be used as a Media Remote (MR) that receives media
 * notifications from a Media Source (NS). The MS is typically an iOS
 * device acting as a server. For terminology and up-to-date specs, see
 * http://developer.apple.com.
 *
 * Once a connection is established with a central device, the module does a service discovery to
 * discover the AMS server handles. If this succeeds (@ref BLE_AMS_C_EVT_DISCOVERY_COMPLETE),
 * the handles for the AMS server are part of the @ref ble_ams_c_evt_t structure and must be
 * assigned to an AMS_C instance using the @ref nrf_ble_ams_c_handles_assign function. For more
 * information about service discovery, see the @ref lib_ble_db_discovery documentation.
 *
 * The application can now register to iOS notifications using
 * @ref ble_ams_c_notif_source_notif_enable. They arrive in the @ref BLE_AMS_C_EVT_NOTIF event.
 * @ref nrf_ble_ams_c_request_attrs can be used to request attributes for the notifications. They
 * arrive in the @ref BLE_AMS_C_EVT_NOTIF_ATTRIBUTE event.
 * @ref nrf_ble_ams_c_app_attr_request can be used to request attributes of the app that issued
 * the notifications. They arrive in the @ref BLE_AMS_C_EVT_APP_ATTRIBUTE event.
 * @ref nrf_ams_perform_notif_action can be used to make the Notification Provider perform an
 * action based on the provided notification.
 *
 * @msc
 * hscale = "1.5";
 * Application, AMS_C;
 * |||;
 * Application=>AMS_C   [label = "ble_ams_c_attr_add(attribute)"];
 * Application=>AMS_C   [label = "ble_ams_c_init(ams_instance, event_handler)"];
 * ...;
 * Application<<=AMS_C  [label = "BLE_AMS_C_EVT_DISCOVERY_COMPLETE"];
 * Application=>AMS_C   [label = "ble_ams_c_handles_assign(ams_instance, conn_handle, service_handles)"];
 * Application=>AMS_C   [label = "ble_ams_c_notif_source_notif_enable(ams_instance)"];
 * Application=>AMS_C   [label = "ble_ams_c_data_source_notif_enable(ams_instance)"];
 * |||;
 * ...;
 * |||;
 * Application<<=AMS_C  [label = "BLE_AMS_C_EVT_NOTIF"];
 * |||;
 * ...;
 * |||;
 * Application=>AMS_C   [label = "ble_ams_c_request_attrs(attr_id, buffer)"];
 * Application<<=AMS_C  [label = "BLE_AMS_C_EVT_NOTIF_ATTRIBUTE"];
 * |||;
 * @endmsc
 *
 * @note    The application must register this module as BLE event observer using the
 *          NRF_SDH_BLE_OBSERVER macro. Example:
 *          @code
 *              ble_ams_c_t instance;
 *              NRF_SDH_BLE_OBSERVER(anything, BLE_AMS_C_BLE_OBSERVER_PRIO,
 *                                   ble_ams_c_on_ble_evt, &instance);
 *          @endcode
 */
#ifndef BLE_AMS_C_H__
#define BLE_AMS_C_H__

#include "ble_types.h"
#include "ble_srv_common.h"
#include "sdk_errors.h"
#include "ble_db_discovery.h"
#include "nrf_sdh_ble.h"

#ifdef __cplusplus
extern "C" {
#endif

/**@brief   Macro for defining a ble_ams_c instance.
 *
 * @param   _name   Name of the instance.
 * @hideinitializer
 */
#define BLE_AMS_C_DEF(_name)                                    \
static ble_ams_c_t _name;                                       \
NRF_SDH_BLE_OBSERVER(_name ## _obs,                             \
                     BLE_AMS_C_BLE_OBSERVER_PRIO,               \
                     ble_ams_c_on_ble_evt, &_name)

/** @brief Macro for defining multiple ble_ams_c instances.
 *
 * @param   _name   Name of the array of instances.
 * @param   _cnt    Number of instances to define.
 * @hideinitializer
 */
#define BLE_AMS_C_ARRAY_DEF(_name, _cnt)                        \
sstatic ble_ams_c_t _name[_cnt];                                \
NRF_SDH_BLE_OBSERVERS(_name ## _obs,                            \
                      BLE_AMS_C_BLE_OBSERVER_PRIO,              \
                      ble_ams_c_on_ble_evt, &_name, _cnt)

/** @brief Constants of the iOS media service.
 */
// Shuffle Mode
#define AMS_SHUFFLE_MODE_OFF                0
#define AMS_SHUFFLE_MODE_ON                 1
#define AMS_SHUFFLE_MODE_ALL                2

// Repeat Mode
#define AMS_REPEAT_MODE_OFF                 0
#define AMS_REPEAT_MODE_ON                  1
#define AMS_REPEAT_MODE_ALL                 2

#define BLE_AMS_EU_MAX_DATA_LENGTH          20                  //!< Maximum data length of an iOS media entity update notification.
#define BLE_AMS_EA_MAX_DATA_LENGTH          64                  //!< Maximum data length of an iOS media entity attribute.

/** @brief UUID's of the iOS media service.
 */
#define AMS_UUID_SERVICE                    0x502B              //!< 16-bit service UUID for the Apple Notification Center Service.
#define AMS_UUID_CHAR_REMOTE_COMMAND        0x81D8              //!< 16-bit remote command UUID.
#define AMS_UUID_CHAR_ENTITY_UPDATE         0xABCE              //!< 16-bit entity update UUID.
#define AMS_UUID_CHAR_ENTITY_ATTRIBUTE      0xF38C              //!< 16-bit entity attribute UUID.

/** @defgroup BLE_AMS_EA_ERROR_CODES Media Source (iOS) Error Codes
 * @{ */
#define BLE_AMS_MS_INVALID_STATE            0x01A0              //!< The MR has not properly set up the AMS, e.g. it wrote to the Entity Update or Entity Attribute characteristic without subscribing to GATT notifications for the Entity Update characteristic.
#define BLE_AMS_MS_INVALID_COMMAND          0x01A1              //!< The command was improperly formatted.
#define BLE_AMS_MS_ABSENT_ATTRIBUTE         0x01A2              //!< The corresponding attribute is empty.
/** @} */

/**@brief Event types that are passed from client to application on an event. */
typedef enum
{
    BLE_AMS_C_EVT_DISCOVERY_COMPLETE,                           /**< Event indicating that the Apple Media Service has been discovered at the peer. */
    BLE_AMS_C_EVT_DISCOVERY_FAILED,                             /**< Event indicating that the Apple Media Service has not been discovered at the peer. */
    BLE_AMS_C_EVT_REMOTE_COMMAND_NOTIFICATION,                  /**< Event indicating that a notification of the Remote Command characteristic has been received from the peer. */
    BLE_AMS_C_EVT_ENTITY_UPDATE_NOTIFICATION,                   /**< Event indicating that a notification of the Entity Update characteristic has been received from the peer. */
    BLE_AMS_C_EVT_ENTITY_ATTRIBUTE_READ_RESP,                   /**< Event indicating that a read response on Entity Attribute characteristic has been received from peer. */
    BLE_AMS_C_EVT_ENTITY_UPDATE_ATTRIBUTE_ERROR                 /**< Event indicating that an error on the Apple Media Service has been received from peer. */
} ble_ams_c_evt_type_t;

/**@brief Remote-Command IDs for iOS media. */
typedef enum
{
    BLE_AMS_REMOTE_COMMAND_ID_PLAY,                             /**< The iOS media command is "play".  */
    BLE_AMS_REMOTE_COMMAND_ID_PAUSE,                            /**< The iOS media command is "pause". */
    BLE_AMS_REMOTE_COMMAND_ID_TOGGLE_PLAY_PAUSE,                /**< The iOS media command is "toggle play-pause". */
    BLE_AMS_REMOTE_COMMAND_ID_NEXT_TRACK,                       /**< The iOS media command is "next track". */
    BLE_AMS_REMOTE_COMMAND_ID_PREVIOUS_TRACK,                   /**< The iOS media command is "previous track". */
    BLE_AMS_REMOTE_COMMAND_ID_VOLUME_UP,                        /**< The iOS media command is "volume-up". */
    BLE_AMS_REMOTE_COMMAND_ID_VOLUME_DOWN,                      /**< The iOS media command is "volume-down". */
    BLE_AMS_REMOTE_COMMAND_ID_ADVANCE_REPEAT_MODE,              /**< The iOS media command is "advance-repeat-mode". */
    BLE_AMS_REMOTE_COMMAND_ID_ADVANCE_SHUFFLE_MODE,             /**< The iOS media command is "advance-shuffle-mode". */
    BLE_AMS_REMOTE_COMMAND_ID_SKIP_FORWARD,                     /**< The iOS media command is "skip-forward". */
    BLE_AMS_REMOTE_COMMAND_ID_SKIP_BACKWARD,                    /**< The iOS media command is "skip-backward". */
    BLE_AMS_REMOTE_COMMAND_ID_LIKE_TRACK,                       /**< The iOS media command is "like track". */
    BLE_AMS_REMOTE_COMMAND_ID_DISLIKE_TRACK,                    /**< The iOS media command is "dislike track". */
    BLE_AMS_REMOTE_COMMAND_ID_BOOKMARK_TRACK                    /**< The iOS media command is "bookmark track". */
} ble_ams_c_remote_control_id_val_t;

/**@brief Entity IDs for iOS media. */
typedef enum
{
    BLE_AMS_ENTITY_ID_PLAYER,                                   /**< The iOS notification was added. */
    BLE_AMS_ENTITY_ID_QUEUE,                                    /**< The iOS notification was modified. */
    BLE_AMS_ENTITY_ID_TRACK                                     /**< The iOS notification was removed. */
} ble_ams_c_evt_id_values_t;

/**@brief Flags for iOS media (Entity Update). */
typedef struct
{
    uint8_t truncated       : 1;                                /**< If this flag is set, the media entity is truncated. */
} ble_ams_c_entity_update_flags_t;

/**@brief Player-Attribute IDs for iOS media. */
typedef enum
{
    BLE_AMS_PLAYER_ATTRIBUTE_ID_NAME,                           /**< The localized name of the app. */
    BLE_AMS_PLAYER_ATTRIBUTE_ID_PLAYBACK_INFO,                  /**< A concatenation of three comma-separated values: PlaybackState, PlaybackRate, ElapsedTime.*/
    BLE_AMS_PLAYER_ATTRIBUTE_ID_VOLUME                          /**< The floating point value of the volume, ranging from 0 (silent) to 1 (full volume). */
} ble_ams_c_player_attribute_id_val_t;

