jimmywong2003/nrf5-ancs-ams-wristband-example/sdk_mod/ble_ams_c/nrf_ble_ams_c.h
/**@brief Queue-Attribute IDs for iOS media. */
typedef enum
{
    BLE_AMS_QUEUE_ATTRIBUTE_ID_INDEX,                           /**< The integer value of the queue index, zero-based. */
    BLE_AMS_QUEUE_ATTRIBUTE_ID_COUNT,                           /**< The integer value of the total number of items in the queue.*/
    BLE_AMS_QUEUE_ATTRIBUTE_ID_SHUFFLE_MODE,                    /**< The integer value of the shuffle mode. */
    BLE_AMS_QUEUE_ATTRIBUTE_ID_REPEAT_MODE                      /**< The integer value value of the repeat mode. */
} ble_ams_c_queue_attribute_id_val_t;

/**@brief Track-Attribute IDs for iOS media. */
typedef enum
{
    BLE_AMS_TRACK_ATTRIBUTE_ID_ARTIST,                          /**< The name of the artist. */
    BLE_AMS_TRACK_ATTRIBUTE_ID_ALBUM,                           /**< The name of the album.*/
    BLE_AMS_TRACK_ATTRIBUTE_ID_TITLE,                           /**< The title of the track. */
    BLE_AMS_TRACK_ATTRIBUTE_ID_DURATION                         /**< The floating point value of the total duration of the track in seconds. */
} ble_ams_c_track_attribute_id_val_t;

/**@brief iOS media remote command request structure. */
typedef struct
{
    uint8_t                         remote_command;             //!< The media command to be executed.
} ble_ams_c_rc_request_t;

/**@brief iOS media remote command notification structure. */
typedef struct
{
    uint8_t                         remote_command_len;         //!< The media command to be executed.
    uint8_t*                        remote_command_list;        //!< The list of the currently supported commands.
} ble_ams_c_rc_notification_t;

/**@brief iOS media entity update command structure. */
typedef struct
{
    uint8_t                         entity_id;                  //!< ID of the desired entity.
    uint8_t                         entity_len;                 //!< Length of the entity update command data.
    uint8_t*                        p_entity_attribute_list;    //!< List of desired entity attributes.
} ble_ams_c_eu_command_t;

/**@brief iOS entity update command notification structure. */
typedef struct
{
    uint8_t                         entity_id;                  //!< The entity to which the subsequent attribute corresponds.
    uint8_t                         attribute_id;               //!< The attribute whose value is being sent in the notification.
    uint8_t                         entity_update_flag;         //!< Bitmask whose set bits give the MR specific information about the notification.
    uint8_t                         entity_update_data_len;     //!< Length of the entity update data.
    const uint8_t *                 p_entity_update_data;       //!< Pointer to the buffer which contains the String corresponding to the value associated with the given attribute.
} ble_ams_c_eu_notification_t;

typedef struct
{
    uint16_t                        entity_id;                  //!< The entity the subsequent attribute corresponds to.
    uint32_t                        attribute_id;               //!< The attribute whose value is to be loaded as the characteristic’s value.
} ble_ams_c_ea_command_t;

typedef struct
{
    uint8_t                         attribute_len;              //!< Length of the entity attribute data.
    uint8_t                         attribute_offset;           //!< Offset of the entity attribute read.
    const uint8_t *                 p_entity_attribute_data;    //!< Pointer to the buffer which contains the String corresponding to the value associated with the given attribute.
} ble_ams_c_ea_read_response_t;

/**@brief Structure used for holding the Apple Media Service found during the
          discovery process.
 */
typedef struct
{
    ble_gattc_service_t             service;                    //!< The GATT Service holding the discovered Apple Media Service. (0x502B).
    ble_gattc_char_t                remote_command_char;        //!< AMS Remote Command Characteristic. Allows interaction with the peer (0x81D8).
    ble_gattc_desc_t                remote_command_cccd;        //!< AMS Remote Command Characteristic Descriptor. Enables or disable GATT notifications.
    ble_gattc_char_t                entity_update_char;         //!< AMS Entity Update Characteristic. Contains the different information about the desired attributes (0xABCE).
    ble_gattc_desc_t                entity_update_cccd;         //!< AMS Entity Update Characteristic Descriptor. Enables or disables GATT notifications.
    ble_gattc_char_t                entity_attribute_char;      //!< AMS Entity Attribute Characteristic, where the extended value of an attribute can be received (0xF38C).
} ble_ams_c_service_t;

/**@brief AMS client module event structure.
 *
 * @details The structure contains the event that should be handled by the main application.
 */
typedef struct
{
    ble_ams_c_evt_type_t            evt_type;                   //!< Type of event.
    uint16_t                        conn_handle;                //!< Connection handle on which the AMS service was discovered on the peer device. This field will be filled if the @p evt_type is @ref BLE_AMS_C_EVT_DISCOVERY_COMPLETE.
    ble_ams_c_rc_notification_t     remote_command_data;        //!< iOS Remote Command list. This field will be filled if @p evt_type is @ref BLE_AMS_C_EVT_REMOTE_COMMAND_NOTIFICATION.
    ble_ams_c_eu_notification_t     entity_update_data;         //!< iOS Entity Update data. This field will be filled if @p evt_type is @ref BLE_AMS_C_EVT_ENTITY_UPDATE_NOTIFICATION.
    ble_ams_c_ea_read_response_t    entity_attribute_data;      //!< iOS Entity Attribute data. This field will be filled if @p evt_type is @ref BLE_AMS_C_EVT_ENTITY_ATTRIBUTE_READ_RESPONSE.
    uint16_t                        err_code_ms;                //!< An error coming from the Media Source. This field will be filled with @ref BLE_AMS_EA_ERROR_CODES if @p evt_type is @ref BLE_AMS_C_EVT_ENTITY_UPDATE_ATTRIBUTE_ERROR.
    ble_ams_c_service_t             service;                    //!< Information on the discovered Apple Media Service. This field will be filled if the @p evt_type is @ref BLE_AMS_C_EVT_DISCOVERY_COMPLETE.
} ble_ams_c_evt_t;

/**@brief iOS media event handler type. */
typedef void (*ble_ams_c_evt_handler_t) (ble_ams_c_evt_t * p_evt);

/**@brief iOS media structure, which contains various status information for the client. */
typedef struct
{
    ble_ams_c_evt_handler_t         evt_handler;                //!< Event handler to be called for handling events in the Apple Media client application.
    ble_srv_error_handler_t         error_handler;              //!< Function to be called in case of an error.
    uint16_t                        conn_handle;                //!< Handle of the current connection. Set with @ref nrf_ble_ams_c_handles_assign when connected.
    ble_ams_c_service_t             service;                    //!< Structure to store the different handles and UUIDs related to the service.
    ble_ams_c_evt_t                 evt;                        //!< Event structure which contains all required information of incoming Apple Media Service data.
} ble_ams_c_t;

