jimmywong2003/nrf5-ancs-ams-wristband-example/sdk_mod/ble_ams_c/nrf_ble_ams_c.h
/**@brief Apple Media client init structure, which contains all options and data needed for
 *        initialization of the client. */
typedef struct
{
    ble_ams_c_evt_handler_t         evt_handler;                //!< Event handler to be called for handling events in the Battery Service.
    ble_srv_error_handler_t         error_handler;              //!< Function to be called in case of an error.
} ble_ams_c_init_t;

/**@brief Apple Media Service UUIDs. */
extern const ble_uuid128_t          ble_ams_base_uuid128;       //!< Service UUID.
extern const ble_uuid128_t          ble_ams_rc_base_uuid128;    //!< Remote Control UUID.
extern const ble_uuid128_t          ble_ams_eu_base_uuid128;    //!< Entity Update UUID.
extern const ble_uuid128_t          ble_ams_ea_base_uuid128;    //!< Entity Attribute UUID.

/**@brief Function for handling the application's BLE stack events.
 *
 * @details Handles all events from the BLE stack that are of interest to the AMS client.
 *
 * @param[in] p_ble_evt         Event received from the BLE stack.
 * @param[in] p_context         AMS client structure.
 */
void ble_ams_c_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);

/**@brief     Function for handling events from the database discovery module.
 *
 * @details   This function will handle an event from the database discovery module and determine
 *            if it relates to the discovery of AMS at the peer. If so, it will
 *            call the application's event handler indicating that AMS has been
 *            discovered at the peer. It also populates the event with the service related
 *            information before providing it to the application.
 *
 * @param[in] p_ams_c           Pointer to the AMS client structure.
 * @param[in] p_evt             Pointer to the event received from the database discovery module.
 */
void ble_ams_c_on_db_disc_evt(ble_ams_c_t * p_ams_c, ble_db_discovery_evt_t * p_evt);
 
/**@brief Function for initializing the AMS client.
 *
 * @param[out] p_ams_c          AMS client structure. This structure must be
 *                              supplied by the application. It is initialized by this function
 *                              and will later be used to identify this particular client instance.
 * @param[in]  p_ams_init       Information needed to initialize the client.
 *
 * @retval NRF_SUCCESS  If the client was initialized successfully. Otherwise, an error code is returned.
 */
ret_code_t ble_ams_c_init(ble_ams_c_t * p_ams_c, ble_ams_c_init_t const * p_ams_init);

/**@brief Function for creating a TX message for writing a CCCD.
 *
 * @param[in] conn_handle       Connection handle on which to perform the configuration.
 * @param[in] handle_cccd       Handle of the CCCD.
 * @param[in] enable            Enable or disable GATTC notifications.
 *
 * @retval NRF_SUCCESS              If the message was created successfully.
 * @retval NRF_ERROR_INVALID_PARAM  If one of the input parameters was invalid.
 */
uint32_t cccd_configure(const uint16_t conn_handle, const uint16_t handle_cccd, bool enable);

/**@brief Function for writing to the CCCD to enable remote command notifications from the Apple Media Service.
 *
 * @param[in] p_ams_c           iOS media structure. This structure must be supplied by
 *                              the application. It identifies the particular client instance to use.
 *
 * @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
 */
ret_code_t ble_ams_c_remote_command_notif_enable(ble_ams_c_t const * p_ams_c);


/**@brief Function for writing to the CCCD to enable entity update notifications from the Apple Media Service.
 *
 * @param[in] p_ams_c           iOS media structure. This structure must be supplied by
 *                              the application. It identifies the particular client instance to use.
 *
 * @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
 */
ret_code_t ble_ams_c_entity_update_notif_enable(ble_ams_c_t const * p_ams_c);


/**@brief Function for writing to the CCCD to disable remote command notifications from the Apple Media Service.
 *
 * @param[in] p_ams_c           iOS media structure. This structure must be supplied by
 *                              the application. It identifies the particular client instance to use.
 *
 * @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
 */
ret_code_t ble_ams_c_remote_command_notif_disable(ble_ams_c_t const * p_ams_c);


/**@brief Function for writing to the CCCD to disable entity update notifications from the Apple Media Service.
 *
 * @param[in] p_ams_c           iOS media structure. This structure must be supplied by
 *                              the application. It identifies the particular client instance to use.
 *
 * @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
 */
ret_code_t ble_ams_c_entity_update_notif_disable(ble_ams_c_t const * p_ams_c);

/**@brief Function for receiving and validating media remote command notifications received from the Media Source.
 *
 * @param[in] p_ams_c           Pointer to an AMS instance to which the event belongs.
 * @param[in] p_data_src        Pointer to data that was received from the Media Source.
 * @param[in] hvx_len           Length of the data that was received by the Media Source.
 */
void parse_remote_comand_notifications(ble_ams_c_t const * p_ams_c,
                                       ble_gattc_evt_hvx_t const * remote_command_notification);

/**@brief Function for receiving and validating media entity update notifications received from the Media Source.
 *
 * @param[in] p_ams_c           Pointer to an AMS instance to which the event belongs.
 * @param[in] p_data_src        Pointer to data that was received from the Media Source.
 * @param[in] hvx_len           Length of the data that was received by the Media Source.
 */
void parse_entity_update_notification(ble_ams_c_t const * p_ams_c,
                                      ble_gattc_evt_hvx_t const * entity_update_notification);

/**
 * \brief	Function for writing the remote command to the corresponding characteristic.
 *
 * \details	This function will write a new value into the Remote Command characteristic.
 *
 * @param[in] p_ams_c           Pointer to an AMS instance to which the event belongs.
 * \param[in] cmd	            New Remote Command
 */
ret_code_t ble_ams_c_remote_command_write(ble_ams_c_t const * p_ams_c,
                                          ble_ams_c_remote_control_id_val_t cmd);

/**
 * \brief	Function for writing the remote command to the corresponding characteristic.
 *
 * \details	This function will write a new value into the Remote Command characteristic.
 *
 * @param[in] p_ams_c           Pointer to an AMS instance to which the event belongs.
 * \param[in] entity_id	        ID of the desired Entity
 * \param[in] attribute_number  Size of the attribute list
 * \param[in] attribute_list    List of the desired attributes
 */
ret_code_t ble_ams_c_entity_update_write(ble_ams_c_t const * p_ams_c,
                                         ble_ams_c_evt_id_values_t entity_id,
                                         uint8_t attribute_number,
                                         uint8_t * attribute_list);

/**
 * \brief	Function for writing the remote command to the corresponding characteristic.
 *
 * \details	This function will write a new value into the Remote Command characteristic.
 *
 * @param[in] p_ams_c           Pointer to an AMS instance to which the event belongs.
 * \param[in] entity_id	        ID of the desired Entity
 * \param[in] attribute_id      ID of the desired Attribute
 */
ret_code_t ble_ams_c_entity_attribute_write(ble_ams_c_t const * p_ams_c,
                                            ble_ams_c_evt_id_values_t entity_id,
                                            uint8_t attribute_id);

/**
 * \brief	Function for reading the new value of the function mode characteristic.
 *
 * \details	This function will read the new value from the Entity Attribute characteristic.
 *
 * @param[in] p_ams_c           Pointer to an AMS instance to which the event belongs.
 * @param[in] read_offset       Offset value for the read request.
 */
ret_code_t ble_ams_c_entity_attribute_read(ble_ams_c_t const * p_ams_c, uint8_t read_offset);

/**@brief Function for assigning a handle to this instance of ams_c.
 *
 * @details Call this function when a link has been established with a peer to
 *          associate this link to this instance of the module. This makes it
 *          possible to handle several link and associate each link to a particular
 *          instance of this module. The connection handle and attribute handles will be
 *          provided from the discovery event @ref BLE_AMS_C_EVT_DISCOVERY_COMPLETE.
 *
 * @param[in] p_ams_c       Pointer to the AMS client structure instance to associate with these
 *                          handles.
 * @param[in] conn_handle   Connection handle to associate with the given AMS instance.
 * @param[in] p_service     Attribute handles on the AMS server that you want this ANCS client to
 *                          interact with.
 *
 * @retval    NRF_SUCCESS    If the operation was successful.
 * @retval    NRF_ERROR_NULL If @p p_ams was a NULL pointer.
 */
ret_code_t nrf_ble_ams_c_handles_assign(ble_ams_c_t                 * p_ams_c,
                                        uint16_t const                conn_handle,
                                        ble_ams_c_service_t const   * p_service);
                                        
#ifdef __cplusplus
}
#endif

#endif // BLE_AMS_C_H__

/** @} */
